ldap/ldap.html
<!DOCTYPE html>
<html>
<head>
<title>LDAP安装及应用教程</title>
<!-- 2018-10-09 Tue 23:44 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Jiang Shengfei">
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>
<div id="content">
<h1 class="title">LDAP安装及应用教程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 服务器安装</a>
<ul>
<li><a href="#sec-1-1">1.1. 安装环境</a></li>
<li><a href="#sec-1-2">1.2. 安装步骤</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Ubuntu系统认证</a></li>
<li><a href="#sec-3">3. 无线热点认证</a>
<ul>
<li><a href="#sec-3-1">3.1. 在服务器中设置</a></li>
</ul>
</li>
<li><a href="#sec-4">4. proftpd使用ldap授权登录</a>
<ul>
<li><a href="#sec-4-1">4.1. 安装proftpd</a></li>
<li><a href="#sec-4-2">4.2. 配置proftpd</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 服务器安装</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 安装环境</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Openldap和freeradius都安装在debian8操作系统中。
</p>
<pre class="example">
服务器操作系统:debian 8
客户端操作系统:ubuntu 15.10
Openldap:
freeradius:
</pre>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 安装步骤</h3>
<div class="outline-text-3" id="text-1-2">
<p>
安装服务器软件:
</p>
<pre class="example">
sudo apt-get update
sudo apt-get install slapd ldap-utils //安装openldap服务器软件,我们需要输入管理员密码
sudo apt-get install apache2 php5 php5-mysql //安装phpldapadmin基础软件
sudo apt-get install phpldapadmin //安装ldap web管理软件
sudo apt-get install freeradius freeradius-ldap  //安装radius服务器软件
</pre>
<p>
重新配置:
</p>
<pre class="example">
执行sudo dpkg-reconfigure slapd
我们需要回答的问题有：
Omit OpenLDAP server configuration? 回答No
DNS domain name: 基于输入的domain创建基本的目录结构。读上面的信息理解它是如何工作的。如果你有指向服务器的域名，可以使用域名。我使用test.swfu.edu.cn为例。
Organization name: 我使用cs为例。
Administrator password: 安装时输入密码。
Database backend to use: HDB
removed when slapd is purged? No
Move old database? Yes
Allow LDAPv2 protocol? NO
</pre>
<p>
配置phpldapadmin:
</p>
<pre class="example">
vim /etc/phpldapadmin/config.php
$servers-&gt;setValue('server','host','127.0.0.1');
$servers-&gt;setValue('server','base',array('dc=test,dc=swfu,dc=edu,dc=cn'));  //修改base
$servers-&gt;setValue('login','bind_id','cn=admin,dc=test,dc=swfu,dc=edu,dc=cn'); //修改bind_di
$config-&gt;custom-&gt;appearance['hide_template_warning'] = true;
</pre>
<p>
然后我们在浏览器中输入 <a href="http://ldap_ip/phpldapadmin">http://ldap_ip/phpldapadmin</a> 来使用刚才输入的密码登陆。所有服务器的工作都已完成，我们就可以在上面创建组和用户。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Ubuntu系统认证</h2>
<div class="outline-text-2" id="text-2">
<p>
软件安装:
</p>
<pre class="example">
sudo apt-get install ldap-utils libpam-ldap libnss-ldap nslcd
在安装过程中程序会提示我们输入ldap服务器地址，帐号，密码等信息，按照提示输入即可
sudo dpkg-reconfigure ldap-auth-config //可以重新进行配置
</pre>
<p>
修改配置文件:
</p>
<pre class="example">
vi /etc/ldap.conf
将uri ldapi:///192.168.200.136:389修改成
uri ldap://192.168.200.136
</pre>
<p>
系统认证方式中添加ldap:
</p>
<pre class="example">
auth-client-config -t nss -p lac_ldap
</pre>
<p>
使用认证通过后自动创建用户家目录:
</p>
<pre class="example">
vi /etc/pam.d/common-session,追加内容:
session required pam_mkhomedir.so skel=/etc/skel umask=0022
</pre>
<p>
配置开启ldap认证方式:
</p>
<pre class="example">
pam-auth-update
</pre>
<p>
执行:
</p>
<pre class="example">
update-rc.d nslcd enable
</pre>
<p>
配置可在本机通过passwd更改用户密码:
</p>
<pre class="example">
vi /etc/pam.d/common-password,去除其中的use_authtok参数
</pre>
<p>
重启相关服务:
</p>
<pre class="example">
/etc/init.d/nscd restart
</pre>
<p>
登陆或者切换用户时即通过ldap进行认证，例如切换为ldap中的用户test:
</p>
<pre class="example">
su - test
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 无线热点认证</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 在服务器中设置</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
vim /etc/freeradius/client.conf
client 192.168.200.0/24 {
      secret = radius
}

vim /etc/freeradius/modules/ldap
server = 127.0.0.1
identity = "cn=admin,dc=test,dc=swfu,dc=edu,dc=cn"
password = admin_password
basedn = "dc=test,dc=swfu,dc=edu,dc=cn"
把set_auth_type = yes 取消注释

编辑default 下面的包含ldap 的字符在“authorize” 和 “authenticate”的会话下面，取消注释
vim /etc/freeradius/sites-available/default
authorize{
ldap
}
authenticate{
Auth-Type LDAP{
ldap
}
}

编辑/etc/freeradius/sites-available/inner-tunnel文件,操作和上面的文件一样。
</pre>
<p>
重启服务，配置生效:
</p>
<pre class="example">
/etc/init.d/freeradius restart
</pre>
<p>
所有的配置完成，看看是否成功，在客户端上执行:
</p>
<pre class="example">
radtest 用户名 密码 服务器地址 端口 通讯密钥例如：
radtest zrg 123qwe 192.168.200.136 0 radius
如果返回: rad_recv: Access-Accept packet from host 192.168.200.136 port 1812, id=35, length=20 信息则说已完成配置。
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> proftpd使用ldap授权登录</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 安装proftpd</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
sudo apt-get install proftpd-mod-ldap
</pre>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 配置proftpd</h3>
<div class="outline-text-3" id="text-4-2">
<p>
修改/etc/proftpd/proftpd.conf,去掉以下几行注释:
</p>
<pre class="example">
DefaultRoot       ~/ftp
RequireValidShell off
Include /etc/proftpd/ldap.conf
</pre>
<p>
修改/etc/proftpd/modules.conf去掉注释:
</p>
<pre class="example">
LoadModule mod_ldap.c
</pre>
<p>
修改配置文件/etc/proftpd/ldap.conf:
</p>
<pre class="example">
&lt;IfModule mod_ldap.c&gt;
LDAPServer ldap://localhost/??sub
LDAPBindDN "cn=admin,dc=example,dc=com" "adminPassword"
LDAPUsers ou=users,dc=example,dc=com (uid=%u)

LDAPForceDefaultGID on
LDAPForceDefaultUID on

# proftpd uid &amp; gid                                                             
# $ id proftpd                                                                  
LDAPDefaultGID 65534
LDAPDefaultUID 107

# 设置用户的主目录。设置为 /home/ftp 作为 LDAP 用户登录的主目录 注意：要事先创建 /home/ftp 目录，并正确授&gt;
LDAPGenerateHomedir on
# $ sudo mkdir /home/ftp                                                        
# $ sudo chown proftpd:nogroup /home/ftp                                        
LDAPGenerateHomedirPrefix /home/ftp
LDAPForceGeneratedHomedir on
# 在用户主目录下，创建用户个人目录。如果设置为 on，则所有用户共享同一主目录     
LDAPGenerateHomedirPrefixNoUsername off
# 如果用户主目录不存在，创建它                                                  
CreateHome on
&lt;/IfModule&gt;
</pre>
<p>
其中的LDAPDefaultUID与LDAPDefaultGID为proftpd用户的uid与gid，可以通过一下命令查看:
</p>
<pre class="example">
cat /etc/passwd | grep proftpd
</pre>
<p>
创建FTP目录，我们在home目录下建立FTP目录，并赋予相应的权限:
</p>
<pre class="example">
sudo mkdir /home/ftp
sudo chown proftpd:nogroup /home/ftp
</pre>
<p>
重启proftpd服务:
</p>
<pre class="example">
service proftpd restart
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jiang Shengfei</p>
<p class="date">Created: 2018-10-09 Tue 23:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
